app/views/tasks/create.js.erb

INSERT INTO "tasks" ("created_at", "updated_at", "title", "deadline", "category_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2019-08-28 09:20:29.047817"], ["updated_at", "2019-08-28 09:20:29.047817"], ["title", "test"], ["deadline", "2019-08-31 00:00:00"], ["category_id", 2]]
---
alert("Le task va être créé !");
document.getElementById('<%=@category.title.split(" ")[0]%>').insertAdjacentHTML("beforeend", "<%= j render 'task', task: @task %>")