app/controllers/tasks_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "tasks" ("created_at", "updated_at", "title", "deadline", "category_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2019-08-28 08:50:46.871935"], ["updated_at", "2019-08-28 08:50:46.871935"], ["title", "test  de task"], ["deadline", "2019-08-30 00:00:00"], ["category_id", 1]]
---
  def create
    @task = Task.new(task_params)
    @category = Category.find(category_params)
    @task.category = @category
    if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]
---
  def edit
    @task = Task.find(params[:id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "tasks" SET "updated_at" = $1, "status" = $2 WHERE "tasks"."id" = $3  [["updated_at", "2019-08-29 03:36:46.456473"], ["status", true], ["id", 100]]
---
  def update
    @task = Task.find(params[:id])
    @task.update(task_params)

    statusValue = params[:statusValue].to_i
    if statusValue == 1
      @task.status = true
    else
      @task.status = false
    end
    if @task.save()

SELECT "tasks".* FROM "tasks"
---
  def index
    @tasks = Task.all

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 105], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 105]]
---
  def destroy
    @task = Task.find(params[:id])
    @task.destroy